spec/fixtures/responses/sales_invoices.json

[
  {
    "id": "151541225475802119",
    "administration_id": 123,
    "contact_id": "151541225398207492",
    "contact": {
      "id": "151541225398207492",
      "administration_id": 123,
      "company_name": "Foobar Holding B.V.",
      "firstname": "",
      "lastname": "",
      "address1": "Hoofdstraat 12",
      "address2": "",
      "zipcode": "1234AB",
      "city": "Amsterdam",
      "country": "NL",
      "phone": "",
      "delivery_method": "Email",
      "customer_id": "1",
      "tax_number": "",
      "chamber_of_commerce": "",
      "bank_account": "",
      "attention": "",
      "email": "info@example.com",
      "send_invoices_to_attention": "",
      "send_invoices_to_email": "info@example.com",
      "send_estimates_to_attention": "",
      "send_estimates_to_email": "info@example.com",
      "sepa_active": false,
      "sepa_iban": "",
      "sepa_iban_account_name": "",
      "sepa_bic": "",
      "sepa_mandate_id": "",
      "sepa_mandate_date": null,
      "sepa_sequence_type": "FRST",
      "credit_card_number": "",
      "credit_card_reference": "",
      "credit_card_type": null,
      "tax_number_validated_at": null,
      "created_at": "2016-03-23T13:49:56.317Z",
      "updated_at": "2016-03-23T13:49:56.317Z",
      "notes": [

      ],
      "custom_fields": [

      ]
    },
    "invoice_id": "2016-0001",
    "workflow_id": "151540702793172070",
    "document_style_id": "151540703065801840",
    "identity_id": "151540702457627749",
    "state": "open",
    "invoice_date": "2016-03-23",
    "due_date": "2016-04-06",
    "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van het factuurnummer {document.invoice_id}. Voor vragen kunt u contact opnemen per e-mail.",
    "reference": "Project X",
    "language": "nl",
    "currency": "EUR",
    "discount": "0.0",
    "original_sales_invoice_id": null,
    "paid_at": null,
    "sent_at": "2016-03-23",
    "created_at": "2016-03-23T13:49:56.391Z",
    "updated_at": "2016-03-23T13:49:56.578Z",
    "details": [
      {
        "id": "151541225479996424",
        "administration_id": 123,
        "tax_rate_id": "151540702391567455",
        "ledger_account_id": "151540702338090077",
        "amount": "1 x",
        "description": "Project X",
        "price": "300.0",
        "row_order": 1,
        "total_price_excl_tax_with_discount": "300.0",
        "total_price_excl_tax_with_discount_base": "300.0",
        "tax_report_reference": [
          "NL/1a"
        ],
        "created_at": "2016-03-23T13:49:56.396Z",
        "updated_at": "2016-03-23T13:49:56.584Z"
      }
    ],
    "payments": [

    ],
    "total_paid": "0.0",
    "total_unpaid": "363.0",
    "prices_are_incl_tax": false,
    "total_price_excl_tax": "300.0",
    "total_price_excl_tax_base": "300.0",
    "total_price_incl_tax": "363.0",
    "total_price_incl_tax_base": "363.0",
    "url": "http://test.host/123/sales_invoices/144f2bd05aaa768980cd5ffe31784f6d6ed944df717ab74f8c2a18d29c1aa54a/9dfcfcf9a3615b633b6f0ce23c1eddd0b7c220337d6930330e6d1b6fd140a809",
    "custom_fields": [

    ],
    "notes": [

    ],
    "attachments": [

    ],
    "events": [
      {
        "user_id": 14587404967144,
        "administration_id": 123,
        "action": "sales_invoice_created",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": null,
        "created_at": "2016-03-23T13:49:56.407Z",
        "updated_at": "2016-03-23T13:49:56.407Z"
      },
      {
        "user_id": 14587404967144,
        "administration_id": 123,
        "action": "sales_invoice_send_email",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {
          "email_address": "info@example.com",
          "email_message": "Geachte Foobar Holding B.V.,\n\nIn de bijlage kunt u factuur 2016-0001 voor onze diensten vinden. Wij verzoeken u vriendelijk de factuur voor 06-04-2016 te voldoen.\n\nMet vriendelijke groet,\n\nParkietje B.V."
        },
        "created_at": "2016-03-23T13:49:56.603Z",
        "updated_at": "2016-03-23T13:49:56.603Z"
      }
    ]
  }
]
